# GetEnumerator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSizeSettings..::..GetEnumerator Method
DuctSizeSettings Class See Also
---
Returns an enumerator that iterates through a collection.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator<KeyValuePair<DuctShape, DuctSizes>> GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of DuctShape, DuctSizes))
```

Visual C++
---
```text
public:
virtual IEnumerator<KeyValuePair<DuctShape, DuctSizes^>>^ GetEnumerator()
```

# ### Return Value
An IEnumerator object that can be used to iterate through the collection.
# ### Implements
IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()
# See Also
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace